posts/anna_library.html
<!DOCTYPE html><html><head><!-- 2025-12-13 --><!-- 2026-01-11 Sun 16:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Visited Anna Centenary Library</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
This was my first time visiting the library, and it is impressive with
its <b><b>8 floors</b></b> (plus a ground floor). The process is very simple:
you don't need to pay any fees. Just drop your bag at the nearby
counter (free of charge). You are allowed to carry a notebook and a
water bottle inside. To enter, you just need to sign in—either in a
physical register or online.
</p>

<p>
If you bring a <b><b>laptop</b></b>, there is a separate sign-in process for
security when entering and exiting. Each floor is divided into two
sections: <b><b>Section A (அ)</b></b> and <b><b>Section B (ஆ)</b></b>.
</p>
<div id="outline-container-org41a0912" class="outline-2">
<h2 id="org41a0912">Floor 1</h2>
<div class="outline-text-2" id="text-org41a0912">
<p>
I spent about 30–45 minutes here. <b><b>Section A</b></b> houses newspapers and
magazines, while <b><b>Section B</b></b> is dedicated to children's books. I
found several tech and science magazines particularly interesting,
including:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Magazine Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">44</td>
<td class="org-left">Tamil Computer</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">Data quest</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">Digit</td>
</tr>

<tr>
<td class="org-right">114</td>
<td class="org-left">Down to earth</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">Electronics for u</td>
</tr>

<tr>
<td class="org-right">146</td>
<td class="org-left">PC Quest</td>
</tr>

<tr>
<td class="org-right">154</td>
<td class="org-left">Stuff</td>
</tr>

<tr>
<td class="org-right">184</td>
<td class="org-left">The book review</td>
</tr>
</tbody>
</table>

<p>
I started with the December 1st edition of <b>Tamil Computer</b>. It
featured fascinating articles on the importance of savings, Linux apps
on Pixel, using the Linux terminal on Android, the benefits of
websites, and how LLMs (Large Language Models) work. I even spotted
articles by my friends: one on <b><b>Spell Checkers</b></b> by Kaniyam Shrini
and another on <b><b>USB Workings</b></b> by Kaleeshwar. It reminded me of a
conversation I had with Shrini last year about open-source
spell-checking tools.
</p>
</div>
</div>

<div id="outline-container-org1e2122a" class="outline-2">
<h2 id="org1e2122a">Floor 3 section A</h2>
<div class="outline-text-2" id="text-org1e2122a">
<p>
Here i explored computer book specially and found quite a lot of interesting books.
</p>
<ul class="org-ul">
<li>Domain Driven Design</li>
</ul>
<p>
I found books from following publication
</p>
<ul class="org-ul">
<li>OReilly</li>
<li>APress</li>
<li>Head First books (WOW)</li>
<li>dummies series (eg: Network for Dummies)</li>
<li>BPB publication</li>
</ul>

<p>
I spent most of my time reading <b>Implementing NLP Use Cases Using
BERT</b>. My interest in this was sparked by AI/ML engineers I've met at
conferences and meetups who recommended studying <b><b>BERT</b></b>
(Bidirectional Encoder Representations from Transformers).
</p>
</div>
</div>

<div id="outline-container-orgaa7cf2e" class="outline-2">
<h2 id="orgaa7cf2e">Floor 5 section A</h2>
<div class="outline-text-2" id="text-orgaa7cf2e">
<p>
Next, I explored the Mathematics section. Two books stood out:
</p>
<ul class="org-ul">
<li>Business calculus DeMystified</li>
<li>Make: Calculus
<ul class="org-ul">
<li>This one is amazing! It teaches calculus using <b><b>OpenSCAD</b></b> (3D
modeling software), which is a very unique approach. I’ll
definitely be coming back for this one.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org66d7774" class="outline-2">
<h2 id="org66d7774">Final Thoughts</h2>
<div class="outline-text-2" id="text-org66d7774">
<p>
  My only regret was <b><b>not bringing my laptop</b></b>. While the library is a
bit of a long commute for me, it is absolutely worth the trip. If you
are in or around Chennai, you should definitely check it out!
</p>
</div>
</div>

<div id="outline-container-orgaa81238" class="outline-2">
<h2 id="orgaa81238">Useful links</h2>
<div class="outline-text-2" id="text-orgaa81238">
<ul class="org-ul">
<li>Library catalogue and Membership
<ul class="org-ul">
<li><a href="https://www.annacentenarylibrary.org/pages/view/library-catalogue">https://www.annacentenarylibrary.org/pages/view/library-catalogue</a></li>
</ul></li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
